social_net/perf_testing/data/composePost/202404260949_40_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1668.478ms, rate sampling interval: 6455ms
  Thread calibration: mean lat.: 1671.272ms, rate sampling interval: 5668ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.87s     6.11s   20.86s    56.85%
    Req/Sec    12.33      3.59    18.00     83.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.89s 
 75.000%   11.24s 
 90.000%   17.24s 
 99.000%   20.86s 
 99.900%   24.48s 
 99.990%   24.48s 
 99.999%   24.48s 
100.000%   24.48s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      34.783     0.000000            1         1.00
     624.127     0.100000           49         1.11
    1075.199     0.200000           98         1.25
    1986.559     0.300000          147         1.43
    5439.487     0.400000          196         1.67
    8888.319     0.500000          245         2.00
    9986.047     0.550000          269         2.22
   10182.655     0.600000          294         2.50
   10436.607     0.650000          318         2.86
   10772.479     0.700000          344         3.33
   11239.423     0.750000          367         4.00
   11599.871     0.775000          379         4.44
   12296.191     0.800000          392         5.00
   13271.039     0.825000          404         5.71
   14098.431     0.850000          416         6.67
   15917.055     0.875000          428         8.00
   16769.023     0.887500          434         8.89
   17252.351     0.900000          441        10.00
   17678.335     0.912500          448        11.43
   18022.399     0.925000          453        13.33
   18497.535     0.937500          459        16.00
   18759.679     0.943750          462        17.78
   19513.343     0.950000          465        20.00
   19660.799     0.956250          468        22.86
   19988.479     0.962500          471        26.67
   20135.935     0.968750          474        32.00
   20185.087     0.971875          476        35.56
   20234.239     0.975000          477        40.00
   20316.159     0.978125          479        45.71
   20611.071     0.981250          480        53.33
   20660.223     0.984375          482        64.00
   20774.911     0.985938          483        71.11
   20774.911     0.987500          483        80.00
   20856.831     0.989062          484        91.43
   21168.127     0.990625          485       106.67
   21463.039     0.992188          486       128.00
   21463.039     0.992969          486       142.22
   21463.039     0.993750          486       160.00
   23314.431     0.994531          487       182.86
   23314.431     0.995313          487       213.33
   24313.855     0.996094          488       256.00
   24313.855     0.996484          488       284.44
   24313.855     0.996875          488       320.00
   24313.855     0.997266          488       365.71
   24313.855     0.997656          488       426.67
   24477.695     0.998047          489       512.00
   24477.695     1.000000          489          inf
#[Mean    =     7871.079, StdDeviation   =     6113.796]
#[Max     =    24461.312, Total count    =          489]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  631 requests in 30.05s, 200.88KB read
  Socket errors: connect 0, read 0, write 0, timeout 652
  Non-2xx or 3xx responses: 259
Requests/sec:     21.00  
Transfer/sec:      6.68KB