social_net/perf_testing/data/composePost/202404260952_100_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1785.298ms, rate sampling interval: 6254ms
  Thread calibration: mean lat.: 1707.287ms, rate sampling interval: 7151ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.22s     5.52s   21.68s    61.45%
    Req/Sec    19.00      8.29    33.00     60.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.38s 
 75.000%   16.05s 
 90.000%   19.27s 
 99.000%   21.68s 
 99.900%   22.35s 
 99.990%   22.82s 
 99.999%   22.82s 
100.000%   22.82s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     146.047     0.000000            1         1.00
    4085.759     0.100000           71         1.11
    6152.191     0.200000          141         1.25
    8142.847     0.300000          211         1.43
    9879.551     0.400000          282         1.67
   10379.263     0.500000          352         2.00
   10846.207     0.550000          387         2.22
   11386.879     0.600000          422         2.50
   12722.175     0.650000          457         2.86
   14393.343     0.700000          493         3.33
   16064.511     0.750000          528         4.00
   16474.111     0.775000          545         4.44
   17235.967     0.800000          564         5.00
   17678.335     0.825000          580         5.71
   18235.391     0.850000          598         6.67
   18694.143     0.875000          616         8.00
   18923.519     0.887500          624         8.89
   19267.583     0.900000          633        10.00
   19496.959     0.912500          643        11.43
   19955.711     0.925000          652        13.33
   20267.007     0.937500          660        16.00
   20496.383     0.943750          664        17.78
   20709.375     0.950000          668        20.00
   20807.679     0.956250          673        22.86
   20922.367     0.962500          677        26.67
   21037.055     0.968750          682        32.00
   21102.591     0.971875          685        35.56
   21118.975     0.975000          686        40.00
   21168.127     0.978125          688        45.71
   21528.575     0.981250          690        53.33
   21594.111     0.984375          693        64.00
   21626.879     0.985938          695        71.11
   21626.879     0.987500          695        80.00
   21676.031     0.989062          696        91.43
   21954.559     0.990625          697       106.67
   22020.095     0.992188          698       128.00
   22085.631     0.992969          699       142.22
   22085.631     0.993750          699       160.00
   22151.167     0.994531          700       182.86
   22151.167     0.995313          700       213.33
   22183.935     0.996094          701       256.00
   22183.935     0.996484          701       284.44
   22183.935     0.996875          701       320.00
   22347.775     0.997266          702       365.71
   22347.775     0.997656          702       426.67
   22347.775     0.998047          702       512.00
   22347.775     0.998242          702       568.89
   22347.775     0.998437          702       640.00
   22822.911     0.998633          703       731.43
   22822.911     1.000000          703          inf
#[Mean    =    11219.746, StdDeviation   =     5515.795]
#[Max     =    22806.528, Total count    =          703]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  836 requests in 30.05s, 265.51KB read
  Socket errors: connect 0, read 0, write 0, timeout 192
  Non-2xx or 3xx responses: 365
Requests/sec:     27.82  
Transfer/sec:      8.84KB