social_net/perf_testing/data/composePost/202404260953_110_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1532.988ms, rate sampling interval: 5292ms
  Thread calibration: mean lat.: 1605.741ms, rate sampling interval: 5906ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.57s     5.19s   23.23s    62.11%
    Req/Sec    16.67      6.26    27.00     83.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.12s 
 75.000%   17.24s 
 90.000%   20.23s 
 99.000%   23.23s 
 99.900%   24.12s 
 99.990%   24.72s 
 99.999%   24.72s 
100.000%   24.72s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      21.647     0.000000            1         1.00
    6426.623     0.100000           62         1.11
    8585.215     0.200000          123         1.25
   10035.199     0.300000          187         1.43
   10444.799     0.400000          246         1.67
   11116.543     0.500000          308         2.00
   11575.295     0.550000          339         2.22
   12279.807     0.600000          369         2.50
   13705.215     0.650000          400         2.86
   15450.111     0.700000          431         3.33
   17285.119     0.750000          462         4.00
   18006.015     0.775000          478         4.44
   18464.767     0.800000          492         5.00
   18874.367     0.825000          508         5.71
   19464.191     0.850000          523         6.67
   19808.255     0.875000          539         8.00
   20037.631     0.887500          547         8.89
   20234.239     0.900000          554        10.00
   20463.615     0.912500          562        11.43
   20791.295     0.925000          569        13.33
   21053.439     0.937500          577        16.00
   21184.511     0.943750          581        17.78
   21430.271     0.950000          585        20.00
   21479.423     0.956250          589        22.86
   21561.343     0.962500          592        26.67
   21757.951     0.968750          596        32.00
   21889.023     0.971875          599        35.56
   21905.407     0.975000          600        40.00
   22036.479     0.978125          602        45.71
   22151.167     0.981250          605        53.33
   22478.847     0.984375          606        64.00
   22708.223     0.985938          607        71.11
   23019.519     0.987500          608        80.00
   23232.511     0.989062          609        91.43
   23478.271     0.990625          610       106.67
   23494.655     0.992188          611       128.00
   23494.655     0.992969          611       142.22
   23724.031     0.993750          612       160.00
   23724.031     0.994531          612       182.86
   23953.407     0.995313          613       213.33
   23953.407     0.996094          613       256.00
   23953.407     0.996484          613       284.44
   24117.247     0.996875          614       320.00
   24117.247     0.997266          614       365.71
   24117.247     0.997656          614       426.67
   24117.247     0.998047          614       512.00
   24117.247     0.998242          614       568.89
   24723.455     0.998437          615       640.00
   24723.455     1.000000          615          inf
#[Mean    =    12571.723, StdDeviation   =     5191.415]
#[Max     =    24707.072, Total count    =          615]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  766 requests in 30.05s, 244.36KB read
  Socket errors: connect 0, read 0, write 0, timeout 159
  Non-2xx or 3xx responses: 274
Requests/sec:     25.49  
Transfer/sec:      8.13KB