social_net/perf_testing/data/composePost/202404260957_190_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1649.485ms, rate sampling interval: 6123ms
  Thread calibration: mean lat.: 1573.403ms, rate sampling interval: 6455ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.58s     5.59s   23.86s    60.29%
    Req/Sec    20.83     10.68    37.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.66s 
 75.000%   16.99s 
 90.000%   20.63s 
 99.000%   23.86s 
 99.900%   26.94s 
 99.990%   27.20s 
 99.999%   27.20s 
100.000%   27.20s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2465.791     0.000000            1         1.00
    5500.927     0.100000           83         1.11
    7278.591     0.200000          165         1.25
    8978.431     0.300000          248         1.43
   10313.727     0.400000          329         1.67
   11657.215     0.500000          411         2.00
   12664.831     0.550000          452         2.22
   13590.527     0.600000          493         2.50
   14417.919     0.650000          534         2.86
   15564.799     0.700000          575         3.33
   16990.207     0.750000          619         4.00
   17858.559     0.775000          638         4.44
   18726.911     0.800000          657         5.00
   19300.351     0.825000          678         5.71
   19660.799     0.850000          698         6.67
   20217.855     0.875000          719         8.00
   20430.847     0.887500          729         8.89
   20627.455     0.900000          739        10.00
   20889.599     0.912500          750        11.43
   21331.967     0.925000          760        13.33
   21643.263     0.937500          770        16.00
   21839.871     0.943750          775        17.78
   21987.327     0.950000          780        20.00
   22069.247     0.956250          786        22.86
   22364.159     0.962500          791        26.67
   22642.687     0.968750          796        32.00
   22822.911     0.971875          799        35.56
   23003.135     0.975000          801        40.00
   23232.511     0.978125          804        45.71
   23347.199     0.981250          806        53.33
   23560.191     0.984375          809        64.00
   23642.111     0.985938          810        71.11
   23773.183     0.987500          811        80.00
   23855.103     0.989062          813        91.43
   23969.791     0.990625          814       106.67
   24526.847     0.992188          815       128.00
   24772.607     0.992969          816       142.22
   24772.607     0.993750          816       160.00
   25460.735     0.994531          817       182.86
   26083.327     0.995313          818       213.33
   26083.327     0.996094          818       256.00
   26525.695     0.996484          819       284.44
   26525.695     0.996875          819       320.00
   26525.695     0.997266          819       365.71
   26935.295     0.997656          820       426.67
   26935.295     0.998047          820       512.00
   26935.295     0.998242          820       568.89
   26935.295     0.998437          820       640.00
   26935.295     0.998633          820       731.43
   27197.439     0.998828          821       853.33
   27197.439     1.000000          821          inf
#[Mean    =    12579.803, StdDeviation   =     5589.685]
#[Max     =    27181.056, Total count    =          821]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  969 requests in 30.05s, 304.97KB read
  Socket errors: connect 0, read 0, write 0, timeout 37
  Non-2xx or 3xx responses: 433
Requests/sec:     32.24  
Transfer/sec:     10.15KB